# -*-coding:utf-8-*-
###############################################################################
####################               正文代码                 ####################
###############################################################################
'''
根据输入计算圆形的其它参数
关于圆形的相关计算公式参考正文
'''

pi = 3.14                                                             # 设置常量
# 输入半径，求周长、面积
r = 3                                                                 # 输入圆形的半径
C = 2 * pi * r                                                        # 计算圆形的周长
S = pi * r ** 2                                                       # 计算圆形的面积
print('半径为',r,'的圆形，其周长等于',C,'；面积等于',S,'。')

#  输入周长，求半径、面积
C = 5                                                                 # 输入圆形的周长
r = C / ( 2 * pi )                                                    # 计算圆形的半径
S = pi * r ** 2                                                       # 计算圆形的面积
print('周长为'+str(C)+'的圆形，其半径为'+str(r)+'；面积等于'+str(S)+'。')

#  输入面积，求半径、周长
S = 5                                                                 # 输入圆形的面积
r = round(( S / pi ) ** 0.5 , 2)                                      # 计算圆形的半径，并保留两位小数
C = round( 2 * pi * r , 2)                                            # 计算圆形的周长，并保留两位小数
str_print = '面积为' + str(S) + '的圆形，其半径为' + str(r) + '；周长等于' + str(C) + '。'
print(str_print)