# -*- coding: utf-8 -*-
###############################################################################
####################               正文代码                 ####################
###############################################################################
score = 78
if score >= 90:
    print('本次考试，成绩等级为：A')
elif score >= 80 & score < 90:
    print('本次考试，成绩等级为：B')
elif score >= 70 & score < 80:
    print('本次考试，成绩等级为：C')
elif score >= 60 & score < 70:
    print('本次考试，成绩等级为：D')
else:
    print('本次考试，成绩等级为：E')
