# -*- coding: utf-8 -*-
###############################################################################
####################               正文代码                 ####################
###############################################################################
#代码 4-14
d = {'a': 1, 'b': 2, 'c': 3}
for key in d:
    print(key)

#代码 4-15
for x, y in [(1, 1), (2, 4), (3, 9)]:
    print(x, y)


#代码 4-16
for x,y,z in [(1,2,3),(4,5,6),(7,8,9)]:
    print(x,y,z)


#代码 4-17
#计算x的三次幂
map(lambda x: x**3, range(6))
[x**3 for x in range(6)]

#当x%2为1时取值
seq = [1,2,3,4,5,6,7,8]
filter(lambda x: x % 2, seq)
[x for x in seq if x % 2]

#代码 4-18
#生成（i，j）
[(i,j) for i in range(0,3) for j in range(0,3)]

[(i,j) for i in range(0,3) if i < 1 for j in range(0,3) if j > 1]
